{
  "backend/main.mo": "Motoko canister implementing user profiles and visit entry CRUD with access control checks and per‑caller ownership rules.",
  "feature_evidence.json": "Feature evidence report mapping two error‑handling features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend files including forms, lists, analytics, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, theme variables, and light/dark mode palettes.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Main React app handling authentication, user profile setup, tab navigation, and coordinating entry creation and editing.",
  "frontend/src/components/analytics/AnalyticsPage.tsx": "Analytics view computing monthly/yearly totals and rendering summary cards, charts, and empty/loading states.",
  "frontend/src/components/analytics/SpendingChart.tsx": "Recharts bar‑chart component displaying hospital and medicine spending with tooltips, legends, and formatted labels.",
  "frontend/src/components/visit/ImportVisitEntriesDialog.tsx": "Dialog component that uploads and parses a CSV of visit records, validates fields, and creates entries via API mutations.",
  "frontend/src/components/visit/MyEntriesList.tsx": "Displays the user's visit entries with sorting, deletion, export, and import options, handling dialogs and loading states.",
  "frontend/src/components/visit/VisitEntryForm.tsx": "Form for creating or editing a visit entry with validation, date handling, and submit logic tied to create/edit mutations.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity state and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, status tracking, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles and visit entries through the backend actor with error handling.",
  "frontend/src/index.css": "Defines Tailwind layers and a full light/dark theme using OKLCH CSS variables including chart colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/utils/errorMessages.ts": "Converts unknown or unsafe errors into short, user‑friendly messages for UI display.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and persisting URL parameters using both query strings and sessionStorage.",
  "frontend/src/utils/visitEntryAnalytics.ts": "Calculates sorted monthly and yearly charge totals from VisitEntry data.",
  "frontend/src/utils/visitEntryExport.ts": "Generates a CSV from visit entries and triggers a client‑side download.",
  "frontend/src/utils/visitEntryImport.ts": "Parses CSV files into validated visit entries, handling dates, numbers, and row‑level errors.",
  "frontend/src/utils/visitEntryPdf.ts": "Builds a printable HTML table of visit entries and opens a print dialog for PDF export.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH theme colors, container settings, animations, and plugins.",
  "project_state.json": "Defines the project’s current build state, features, issues, and versioning for a hospital-visit data entry app. Lists existing implemented features, known bugs, and architectural metadata for planning."
}