{
  "backend/main.mo": "Motoko canister implementing user profiles and CRUD operations for visit entries with access control checks and per‑user ownership enforcement.",
  "feature_evidence.json": "Feature evidence report linking spending chart color updates to specific frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, utilities, and styles.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme variables for light and dark modes, including chart color tokens.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Main React component handling auth, profile setup, navigation tabs, and routing to entry forms, lists, and analytics.",
  "frontend/src/components/analytics/AnalyticsPage.tsx": "Analytics view computing totals and rendering summaries, tables, and spending charts based on visit entries.",
  "frontend/src/components/analytics/SpendingChart.tsx": "Recharts bar chart showing hospital and medicine spending using theme-driven colors, labels, tooltips, and legend.",
  "frontend/src/components/visit/ImportVisitEntriesDialog.tsx": "Dialog component for uploading a CSV, parsing visit entries, validating fields, and bulk-creating entries with success/error toasts.",
  "frontend/src/components/visit/MyEntriesList.tsx": "Lists a user's visit entries with sorting, delete confirmation, export to CSV/PDF, and an import dialog.",
  "frontend/src/components/visit/VisitEntryForm.tsx": "Form for creating or editing a visit entry with validation, date handling, and submit logic for create/edit mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend operations for user profiles and visit entry CRUD with error handling and cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind layers and a full set of light/dark mode CSS variables for UI and chart colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider.",
  "frontend/src/utils/errorMessages.ts": "Converts various error types into short, user-friendly messages with special handling for common backend issues.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/visitEntryAnalytics.ts": "Calculates monthly and yearly totals from VisitEntry records including hospital, medicine, and combined charges.",
  "frontend/src/utils/visitEntryExport.ts": "Creates and downloads a CSV export of visit entries with proper field escaping.",
  "frontend/src/utils/visitEntryImport.ts": "Parses CSV files into structured entries with validation for dates, numbers, and required fields.",
  "frontend/src/utils/visitEntryPdf.ts": "Generates a printable HTML document of visit entries and triggers the browser print dialog.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom color variables, extended utilities, and plugins.",
  "project_state.json": "Stores project metadata, feature list, and known issues for a patient-visit data entry and analytics app."
}