{
  "kind": "build_request",
  "title": "Fix error when saving a new visit entry",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Fix the New Visit Entry save flow so that valid entries can always be saved successfully, and show a clear English error message in the UI when saving fails (instead of failing silently in the console).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "User message: \"Error to save new entry\""
        ]
      },
      "acceptanceCriteria": [
        "From the \"New Entry\" tab, submitting the form with valid values results in the success message and the entry appears in \"My Entries\".",
        "If saving fails for any reason (including client-side BigInt conversion errors or backend errors), the user sees a visible error message in English (e.g., \"Could not save entry. Please try again.\") and the form values are not cleared.",
        "Hospital Charges (Rs) and Medicine Charges (Rs) inputs prevent or clearly validate non-integer values (e.g., decimals) so they cannot cause a BigInt conversion exception on submit.",
        "The app does not rely only on console logs to communicate save failures to the user."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Ensure the visit entry create/edit mutations propagate actionable error details to the UI so that backend traps (for example, authorization or type errors) can be surfaced as a user-friendly English message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "User message: \"Error to save new entry\""
        ]
      },
      "acceptanceCriteria": [
        "When the backend rejects create/edit (e.g., traps), the UI displays an English error message and does not show the success banner.",
        "The error message shown to users is sanitized/user-friendly (no raw stack traces), but should be specific enough to guide the user when possible (e.g., \"Unauthorized. Please sign in again.\")."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (including frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui).",
    "Keep all user-facing text in English.",
    "Backend must remain a single Motoko actor in backend/main.mo; only introduce migration.mo if a state upgrade is required (not expected for this fix)."
  ],
  "nonGoals": [
    "Do not redesign the overall UI theme or navigation for this fix.",
    "Do not add new data fields to visit entries or change the stored schema unless strictly required to fix saving."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}